In [1]:

import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0  18   5   5  11   4
1   2   8   3  18  12
2  18   9   6   6  19
3   9  16  12  19  15
4   3  13   1  19  10

In [3]:

df.query('A > 10')

    A  B  C   D   E
0  18  5  5  11   4
2  18  9  6   6  19

In [4]:

rerata = df['A'].mean()
rerata

np.float64(10.0)

In [5]:

df.query('A > @rerata')

    A  B  C   D   E
0  18  5  5  11   4
2  18  9  6   6  19